pyocd/pyOCD/pyocd/debug/svd/data/LPC5526.xml
        <register>
          <name>PRINCE_REGION1_KEY_CODE13</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION1_KEY_CODE</alternateGroup>
          <addressOffset>0x5C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_HEADER0</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE0</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_HEADER1</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE1</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY0</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE2</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY1</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE3</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY2</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE4</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY3</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE5</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY4</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE6</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY5</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE7</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY6</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE8</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY7</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE9</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY8</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE10</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY9</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE11</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY10</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE12</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_BODY11</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_REGION2_KEY_CODE13</name>
          <description>.</description>
          <alternateGroup>PRINCE_REGION2_KEY_CODE</alternateGroup>
          <addressOffset>0x5FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
